### Series 데이터 개수 세기
1. count()메서드 = 개수를 세주는데~ NaN 값은 세지 않는다.  
   DataFrame에 count()메서드를 사용하면 각 열마다 데이터 개수를 세고, Series로 반환한다.  
   누락된 부분(NaN)을 찾을 때 유용하다.

In [173]:
s = pd.Series(range(10))
s[3] = np.nan
print('count : ',s.count(),'\nlen : ',len(s),end ='\n\n') # len은 길이만.
s

count :  9
len :  10

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

- 데이터 시각화 수업에 배울 seaborn 패키지에 titanic호의 승객 데이터도 있다.
- 아래 예제처럼 DataFrame으로 읽어올 수 있다.

In [261]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

# Series 카테고리 값 세기
2. Series 값이 정수, 문자열,카테고리 값인 경우에는 value_counts()메서드로
   각각의 값이 나온 횟수를 셀 수 있다.
    -  value_counts 의 인자중 normalize = True하면 상대푼포?로 값을 준다.

In [186]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6,size=100))
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [192]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5,size=(4,4)),dtype=float)
df.iloc[2,3] = np.nan
print(df[0].value_counts())
df

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

# DataFrame 값 세기
- DataFrame에서도 value_counts 메서드가 사용 가능하고 column값을 넣어주면 된다.  
  단 column label이 있어야한다. (default로 들어가는 정수형 index의 경우 작동안함.)
- 하지만 NaN값이 있는 row는 개수로 안 친다.

In [248]:
# df.value_counts(1) # 에러나는 구문
df = pd.DataFrame(np.arange(4*4).reshape(4,4))
print(df.value_counts([0,1]))
df = pd.DataFrame(np.arange(4*4).reshape(4,4),columns=list('ABCD'))
print(df)
print(df.value_counts('A'))
print(df.value_counts(['A','B','C']))

0   1
0   1     1
4   5     1
8   9     1
12  13    1
dtype: int64
    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
A
0     1
4     1
8     1
12    1
dtype: int64
A   B   C
0   1   2     1
4   5   6     1
8   9   10    1
12  13  14    1
dtype: int64

### Series 정렬 
- index 기준 = sort_index()
- value 기준 = sort_values() - NaN값이 있을 떄 NaN값이 가장 뒤에 위치하게 됨.
- 큰수에서 작은수로 가는 내림차순으로 변경하기 위해 사용하는 인자는 ascending = False 이다.
- ascending = False 를 해도 NaN은 가장 뒤에 온다.

In [206]:
print(s2.value_counts())
print(s2.value_counts().sort_index())
print(s2.value_counts().sort_values())

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64
0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64
2    13
3    14
5    16
4    17
0    18
1    22
dtype: int64

### Data Frame정렬 
- DataFrame에서 sort_values 매서드를 사용하려면 by 키워드 인수를 
  활용하여 DataFrame의 정렬 기준이 되는 column을 지정해 주어야 한다.
- by키워드 값으로 여러개를 넣어주면 각 1번쨰 기준으로 정렬 후 다음에 오는놈 기준으로 정렬한다.

In [213]:
print(df)
print(df.sort_values(by=1)) # 기준열을 기준으로 row단위로 정렬된다.
print(df.sort_values(by=[1,2]))

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0
     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0
     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [222]:
print(titanic['sex'].value_counts())

male      577
female    314
Name: sex, dtype: int64

In [251]:
print(titanic['age'].value_counts().sort_values(ascending= False))

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
66.00     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [229]:
print(titanic['class'].value_counts())

Third     491
First     216
Second    184
Name: class, dtype: int64

In [231]:
print(titanic['alive'].value_counts())

no     549
yes    342
Name: alive, dtype: int64

### DataFrame 행/열 합계
- sum(axis) 
- axis 인수에는 합계로 인해 없어지는 방향축(0=row , 1 = column) 을 지정한다.
- row의 집계를 구할 때는 sum(axis=1) 메서드를 사용합니다. 
- 그냥 sum() 은 axis=0일때 값을 구한다.

### DataFrame 행/열 평균
- sum과 사용법이 같은 mean()메서드를 사용하면 된다.

In [256]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10 ,size = (4,8)))
print(df2)
print(df2.sum(axis=1))
df2['Rowsum'] = df2.sum(axis=1)
print(df2)
df2.loc['ColTotal2'] = df2.sum()
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1
0    35
1    34
2    41
3    42
dtype: int64
   0  1  2  3  4  5  6  7  Rowsum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

            0   1   2   3   4   5  6   7  Rowsum
0           5   8   9   5   0   0  1   7      35
1           6   9   2   4   5   2  4   2      34
2           4   7   7   9   1   7  0   6      41
3           9   9   7   6   9   1  0   1      42
ColTotal2  24  33  25  24  15  10  5  16     152

In [261]:
del df2[7]
df2.loc['ColTotal'] = df2.mean()
df2

              0     1     2     3     4     5    6  Rowsum
0           5.0   8.0   9.0   5.0   0.0   0.0  1.0    35.0
1           6.0   9.0   2.0   4.0   5.0   2.0  4.0    34.0
2           4.0   7.0   7.0   9.0   1.0   7.0  0.0    41.0
3           9.0   9.0   7.0   6.0   9.0   1.0  0.0    42.0
ColTotal2  24.0  33.0  25.0  24.0  15.0  10.0  5.0   152.0
ColTotal    9.6  13.2  10.0   9.6   6.0   4.0  2.0    60.8

In [262]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [312]:
titanic.loc[titanic.pclass ==1]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [264]:
round(titanic['age'].mean(),1) # 나이평균구하기

29.7

In [305]:
female_age_mean = titanic[titanic.sex =='female']['age'].mean() # 여자 나이평균 구하기
round(female_age_mean,1)

27.9

In [326]:
#여자 이고, pclass가 1인 사람들의 나이 평균 구하기
#내코드
pclass = titanic[titanic.pclass == 1]
round(pclass[pclass.sex=='female']['age'].mean(),1)
#선생님 코드 
round(titanic[(titanic['pclass']==1) & (titanic['sex'] == 'female')]['age'].mean(),1)
# True False bool type 을 구하는 연산들에 대해 &연산을 추가해 조건들을 중첩해 줄 수 있다.
#zeus 코드
titanic.loc[titanic.pclass == 1].loc[titanic.sex == "female"]["age"].mean()

34.6

### DataFrame apply() 메서드
- 함수를 모든 값에 적용하는 함수
- 첫인자로 함수를 피수 값으로 받는다
- 경우에 따라서 두 번째 인자로 axis를 받는다.
    - axis default=  0
    - axis = 0 or 'index' 이면 각column에 적용된다.
    - axis = 1 or 'comuns' 이면 각 row에 적용된다.
    -

In [6]:
import pandas as pd
df = pd.DataFrame([[4,9]]*3, columns=['A','B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [9]:
import numpy as np
print(df.apply(np.sqrt))
np.sqrt(df) # 둘은 같은 값이다.

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [11]:
#axis가 0 일 때 각 column 별 집계합니다.
print(df.apply(np.sum, axis=0))
df.apply(np.sum,axis=1)

A    12
B    27
dtype: int64

0    13
1    13
2    13
dtype: int64

- 수의 return이 column마다 리스트를 반환하면 DataFrame의 결과를 얻을 수 있다.
- 함수의 return이 row마다 리스트를 반환하면 각 row마다 리스트를 하나의 값으로 취급하는 Series 타입의 결과가 나온다
- result_type = 'expand' 을 설정하먄 DataFrame 타입으로 묶어서 나올 수 있다.
- result_Type = 'broadcast' 를 인수로 전달하면 동일한 shape의 결과를 보장한다.   
  함수로부터 반환되는 게 리스트인지 스칼라인지에 상관없이 axis방향으로 브로드캐스트한다. 결과의 column label은 본래의 것을 유지한다.  
  broadcast를 인수로 전달할 때 함수로부터 return된 값이 기존 shape으로 broadcast할 수 없는 shape이라면 ValueError가 발생한다.

In [18]:
print(df.apply(lambda x: [1,2], axis=0)) # DataFrame타입의 결과
print(df.apply(lambda x : [1,2],axis=1)) # Series타입의 결과
print(df.apply(lambda x: [1,2],axis=1,result_type='expand'))
print(df.apply(lambda x : [1,2],axis=1,result_type = 'broadcast'))

   A  B
0  1  1
1  2  2
0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object
   0  1
0  1  2
1  1  2
2  1  2
   A  B
0  1  2
1  1  2
2  1  2

### column마다의 최대값과 최소값의 차이를 구하고 싶으면 다음과 같은 람다 사용

In [25]:
df3 = pd.DataFrame({
    'A' : [1,2,3,4,3],
    'B' : [1,6,5,4,3],
    'C' : [1,5,2,4,4]
    
})
print(df3)
print(df3.apply(lambda x:x.max()-x.min()))
print(df3.apply(lambda x:x.max()-x.min(),axis=1))
print(df3.apply(pd.value_counts)) # 개수 파악하는 함수

   A  B  C
0  1  1  1
1  2  6  5
2  3  5  2
3  4  4  4
4  3  3  4
A    3
B    5
C    4
dtype: int64
0    0
1    4
2    3
3    0
4    1
dtype: int64
     A    B    C
1  1.0  1.0  1.0
2  1.0  NaN  1.0
3  2.0  1.0  NaN
4  1.0  1.0  2.0
5  NaN  1.0  1.0
6  NaN  1.0  NaN

In [29]:
titanic['adult/child'] = titanic.apply(lambda r : 'adult' if r.age>=20 else "child",axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [40]:
titanic['category1'] = titanic.apply(lambda r : r.sex if r.age>20 else 'child',axis=1)
titanic.tail(10)
# np.nan 으로 NaN값 만들 수 있음.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,adult,male
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True,adult,female
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True,adult,male
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,adult,female
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

### DataFrame fillna() 메서드
- fillna() 메서드는 NaN값을 원하는 값으로 바꿀 수 있다. 첫 인자로 변경하고자 하는 값을 전달하면 된다.
- value값으로 column label 을 key로 갖는 딕셔너리를 전달하여 column마다 NaN을 대치하는 값을 각각 설정가능.
- limit 키워드 인자에 숫자를 전달하여 그 숫자만큼 column마다 변경 횟수를 제한 할 수 있다.
- DataFrame을 value로 전달해서 NaN값을 대체할 수 있습니다. 다만 column label과 row index가 일치하지 않으면 적용되지 않는다.

In [52]:
df = pd.DataFrame([[np.nan,2,np.nan,0],
                  [3,4,np.nan,1],
                  [np.nan,np.nan,np.nan,np.nan],
                  [np.nan,3,np.nan,4]], columns = list('ABCD'))
print(df)
print(df.fillna(0))

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0
     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

In [54]:
values = {'A':0,'B' :1,'C':2,'D':3} #column마다 원하는 값으로 NaN값을 채울 수 있다.
print(df.fillna(value=values))

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

In [55]:
print(df.fillna(value=values,limit=2)) # column마다 2회씩만 변경가능.

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  NaN  3.0
3  NaN  3.0  NaN  4.0

In [60]:
df2 = pd.DataFrame(np.zeros((3,4)),columns = list('ABCㅎ')) # column도 ㅎ column이 D와 일치하지 않아서 NaN이 남아있음.
df.fillna(df2)                                              # row도 한줄 짧아서 마지막 row는 NaN이 그대로 남아있음

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  NaN
3  NaN  3.0  NaN  4.0

In [262]:
avg_age = int(titanic['age'].mean()) # 평균값 구함

titanic['age'] = titanic['age'].fillna(avg_age) # fillna에 inplace=True를 넣어주면 할당하지 않고도 알아서 바뀐값이 저장됨.
# print(titanic[titanic['age'].isna()])# age에 NaN값이 없음을 볼 수 있음\
titanic.head(15)
titanic.count()

survived       891
pclass         891
sex            891
age            891
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### DataFrame astype() 메서드
- column의 자료형을 변경하는 메서드

In [99]:
d = {'col1' : [1,2], 'col2' : [3,4]}
df = pd.DataFrame(data=d)
df.dtypes

col1    int64
col2    int64
dtype: object

In [100]:
df.astype('int32').dtypes

col1    int32
col2    int32
dtype: object

In [103]:
df.astype({'col1': 'int32'}).dtypes # dictionary로 지정하여 하나씩 타입변경 가능

col1    int32
col2    int64
dtype: object

In [151]:
titanic['category2'] = titanic['sex'] + titanic['age'].astype('str')

In [152]:
titanic[['age','category2']]

      age   category2
0    22.0    male22.0
1    38.0  female38.0
2    26.0  female26.0
3    35.0  female35.0
4    35.0    male35.0
..    ...         ...
886  27.0    male27.0
887  19.0  female19.0
888   NaN   femalenan
889  26.0    male26.0
890  32.0    male32.0

[891 rows x 2 columns]

### DataFrame 실수 값을 카테고리 값으로 변환
- 실수 값을 크기 기준으로 하여 카테고리 값으로 변환하고 싶을 떄는 다음과 같은 명령을 사용합니다.
- cut : 실수 값의 경계선을 지정하는 경우
    - x = 1차원 형태의 배열 형태가 옵니다.
    - bins = int, 스칼라를 요소로 갖는 시퀀스가 옵니다.
- qcut : 개수가 똑같은 구간으로 나누는 경우(분위수)
    - x = id ndarray 호은 Series
    - q = int 혹은 분위수를 나타내는 1.이하의 실수를 요소로 갖는 list (ex.[0, .25 , .5 , .75, 1.])

In [157]:
ages = [0,2,10,21,23,37,31,61,20,41,32,90,101]
bins = [1,20,30,50,70,100]
label = ['미성년자','청년','장년','중년','노년']
cats = pd.cut(ages,bins,labels = label)
cats      #구간내에 없다면 NaN값이 들어간다.

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '미성년자', '장년', '장년', '노년', NaN]
Length: 13
Categories (5, object): ['미성년자' < '청년' < '장년' < '중년' < '노년']

In [164]:
print(type(cats)) # cut 명령이 반환하는 값은 categorical type이다.
           # 속성으로 label 문자열을 codes속성으로 정수로 인코딩한 카테고리 값을 가집니다.
print(cats.categories)
print(cats.codes)

<class 'pandas.core.arrays.categorical.Categorical'>
Index(['미성년자', '청년', '장년', '중년', '노년'], dtype='object')
[-1  0  0  1  1  2  2  3  0  2  2  4 -1]

In [170]:
df4 = pd.DataFrame(ages,columns = ['ages'])
df4['age_cat'] = pd.cut(df4.ages,bins,labels=label)
print(df4.dtypes)                                   # category 데이터는 문자열 취급이 안된다.(object type임)
df4['age_cat'].astype(str) + df4['ages'].astype(str)# 문자열로 쓰기 위해서는 astype해주는 과정이 필요함.
print(df4.dtypes)
df4

ages          int64
age_cat    category
dtype: object
ages          int64
age_cat    category
dtype: object

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       장년37
6       장년31
7       중년61
8     미성년자20
9       장년41
10      장년32
11      노년90
12    nan101
dtype: object

In [173]:
# qcut은 원하는 개수만큼 여기서는 4개 구간으로 나누어
data = np.random.randn(1000)
cats = pd.qcut(data, 4 , labels=['Q1','Q2','Q3','Q4'])
print(pd.value_counts(cats)) #같은 개수로 나누어 짐을 알 수 있다.
cats

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

['Q4', 'Q1', 'Q3', 'Q1', 'Q4', ..., 'Q4', 'Q4', 'Q3', 'Q3', 'Q3']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [219]:
bins = [0,20,30,50,70,100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]
cuts = pd.cut(titanic['age'],bins,labels = label)
sorted_value_count = pd.value_counts(cuts).sort_index()
print(sorted_value_count)
sorted_value_count / sum(sorted_value_count)

미성년자    179
청년      407
장년      241
중년       59
노년        5
Name: age, dtype: int64

미성년자    0.200898
청년      0.456790
장년      0.270483
중년      0.066218
노년      0.005612
Name: age, dtype: float64

In [1]:
# 못푼문제
bins = [0,20,30,50,70,100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]
cuts = pd.cut(titanic['age'],bins,labels = label)
titanic['age'] = titanic['age' & titanic[cuts != '미성년자']
titanic['category3'] = titanic.apply(lambda i : '미성년자' if i['age']<20 else i['연령층']+('남성' if i['sex']=='male' else ' 여성'),axis=1)
titanic[['연령층','age','sex','category3']]
                         
titanic[titanic['age']<1 | titanic['age']>100]

SyntaxError: invalid syntax (84976391.py, line 5)

### DataFrame 인덱스 설정 및 제거
- set_index = 기존의 row 인덱스를 제거하고 데이터 column 중 하나를 인덱스로 설정합니다.
- reset_index =기존의 row 인덱스를 제거하고 인덱스를 데이터 열로 추가합니다.

In [19]:
import numpy as np
import pandas as pd
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3,5),2)]).T , columns = ['c1','c2','c3','c4'])
print(df1)
df2 = df1.set_index('c1')
print(df2)
df2.set_index('c2') # 기존의 인덱스는 사라진다.

  c1    c2    c3    c4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07
      c2    c3    c4
c1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

        c3    c4
c2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

- reset_index 메서드를 쓰면 보통의 자료열로 바꿀 수도 있다. 이떄 index column은 자료열의 가장 선두로 삽입됩니다.  
  DataFrame의 인덱스는 정수로 된 디폴트 인덱스로 바뀝니다.
  - 인수중에 drop = True로 인수를 전달하면 인덱스 column을 보통의 자료열로 올리는 것이 아니라 그냥 버리게 된다.

In [22]:
print(df2)
print(df2.reset_index())
df2.reset_index(drop = True)

      c2    c3    c4
c1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07
  c1    c2    c3    c4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

     c2    c3    c4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

In [25]:
score = {
    "이름":["일식", "이식", "삼식", "사식", "오식"],
    "국어":[60, 70, 90, 80, 100],
    "영어":[70, 86, 82, 88, 100],
    "수학":[65, 82, 85, 90, 100]
}
scores = pd.DataFrame(score)
scores

   이름   국어   영어   수학
0  일식   60   70   65
1  이식   70   86   82
2  삼식   90   82   85
3  사식   80   88   90
4  오식  100  100  100

In [29]:
scores.set_index('이름',inplace = True)
scores

     국어   영어   수학
이름
일식   60   70   65
이식   70   86   82
삼식   90   82   85
사식   80   88   90
오식  100  100  100

In [28]:
scores.reset_index(inplace = True)
scores

   이름   국어   영어   수학
0  일식   60   70   65
1  이식   70   86   82
2  삼식   90   82   85
3  사식   80   88   90
4  오식  100  100  100

### DataFrame 다중 인덱스
- row나 column에 여러 계층을 가지는 인덱스 즉, 다중 인덱스를 설정할 수도 있습니다.
- DataFrame을 생성할 때 columns 인수에 당므 예제처럼 리스트의 리스트(행렬) 형태로 인덱스를 넣으면 다중 열 인덱스를 가지게 된다.
- 이름을 지정하면 더 편리하게 사용할 수 있습니다. column 인덱스들의 이름 지정은 columns 객체의 names 속성에 리스트를 넣어서 지정합니다.

In [ ]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np_random.randn(5,4)))
df3

In [ ]:
df3.columns.names = ['Cidx1','Cidx2']
df3

In [ ]:
df4 = pd.DataFrame(np.round(np.random.randn(6,4),2),
                  columns = [['A','A','B','B']]
                  
                  )

### DataFrame merge() SQL과 비슷한 부분이 많음.
- merge함수는 두 데이터 프레임의 공통 column 혹은 인덱스를 기준으로 두 개의 테이블을 합친다.  
  이 때 기준이 되는 column, row의 데이터를 key라고 한다.

In [30]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [31]:
df2 = pd.DataFrame({
    '고객번호' : [1001,1001,1005,1006,1008,1001], # 고객번호가 key인데 중복되는 값이 있음.
    '금액' : [10000,20000,15000,5000,100000,30000]
},columns = ['고객번호','금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [34]:
pd.merge(df1,df2) # innder join= 공통 column인 고객번호 column을 기준으로 데이터를 찾아서 합친다.
# 양쪽 DataFrame에 모두 키가 존재하는 데이터만 보여주는 inner join방식을 사용한다.

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

- how = 'outer' = outer join 방식은 키 값이 한쪽에만 있어도 데이터를 보여준다.
- how = 'left' = 첫번째 인수 기준으로 DataFrame의 키 값을 모두 보여준다.
- how = 'right'  = 두번째 인수 기준으로 DataFrame의 키 값을 모두 보여준다.

In [35]:
pd.merge(df1,df2,how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [36]:
pd.merge(df1,df2,how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [37]:
pd.merge(df1,df2,how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000